07-arrays.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-24 Wed 16:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Arrays</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="highlight/styles/vs2015.css">
</head>
<body>
<div id="content">
<h1 class="title">Arrays</h1>
<p>
<b><a href="index.html">Home</a></b>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge32b1f6">1. Arrays</a>
<ul>
<li><a href="#orgba39c1d">1.1. Create</a></li>
<li><a href="#orge829d0c">1.2. Index</a></li>
<li><a href="#org2d75d02">1.3. Length</a></li>
<li><a href="#orge06c2c2">1.4. Gotcha! Equality</a></li>
<li><a href="#orgc87269f">1.5. Methods</a></li>
<li><a href="#org50ec29d">1.6. Gotcha! Sneaky Methods</a></li>
<li><a href="#org0a18df4">1.7. Adding to Arrays</a></li>
</ul>
</li>
<li><a href="#orgb740a94">2. Exercises</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge32b1f6" class="outline-2">
<h2 id="orge32b1f6"><span class="section-number-2">1</span> Arrays</h2>
<div class="outline-text-2" id="text-1">
<p>
What's more common than dealing with a single primitive value (like a number, boolean, or string), is dealing with a collection of values. That's where <b>arrays</b> come in. Arrays are values that are sort of like strings, but instead of holding a list of characters, they can hold a list of any values. If we have an array, we can deal with multiple values all at once. Arrays always have an order; just like writing down a list of groceries, there is an order (top to bottom), even if you don't care about it or use it.
</p>
</div>

<div id="outline-container-orgba39c1d" class="outline-3">
<h3 id="orgba39c1d"><span class="section-number-3">1.1</span> Create</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To create an array is easy! We use square brackets to surround a bunch of values separated by commas, like so: <code>[2, 3, 4, 5]</code>.
</p>

<div class="org-src-container">
<pre class="src src-js">console.log([2, 3, 4, 5]); // print the array
</pre>
</div>

<p>
Naturally, an array itself is a value (even though it holds multiple values inside of it), so we can assign it to a variable.
</p>

<div class="org-src-container">
<pre class="src src-js">const evenNumbers = [2, 4, 6, 8, 10];
console.log(evenNumbers);
</pre>
</div>

<p>
Of course, we don't have to limit ourselves to numbers. Any values work in arrays!
</p>

<div class="org-src-container">
<pre class="src src-js">const fruits = ['apple', 'banana', 'cherry'];
console.log(fruits);

const booleans = [true, false];
console.log(booleans);
</pre>
</div>

<p>
We can also put different types of values in the same array, although it may not be commonly useful.
</p>

<div class="org-src-container">
<pre class="src src-js">const mix = [1, 2, 'apple', true, undefined, null, false, -1000];
console.log(mix);
</pre>
</div>

<p>
We can even put arrays in arrays. This <i>is</i> often useful!
</p>

<div class="org-src-container">
<pre class="src src-js">const matrix = [[1, 2, 3], [4, 5, 6], [7, 8, 9]];
console.log(matrix);
</pre>
</div>
</div>
</div>

<div id="outline-container-orge829d0c" class="outline-3">
<h3 id="orge829d0c"><span class="section-number-3">1.2</span> Index</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Because an array is a list of values, we often need to get one element from that list. Like strings, we can get an element by its <b>index</b> number. Remember that index numbers start from 0, not 1.
</p>

<div class="org-src-container">
<pre class="src src-js">const fruits = ['apple', 'banana', 'cherry'];
console.log(fruits[0]); // apple
console.log(fruits[1]); // banana
console.log(fruits[2]); // cherry
</pre>
</div>

<p>
This also works for nested arrays.
</p>

<div class="org-src-container">
<pre class="src src-js">const matrix = [[1, 2, 3], [4, 5, 6], [7, 8, 9]];
console.log(matrix[1]); // [4, 5, 6]
console.log(matrix[1][0]); // 4
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d75d02" class="outline-3">
<h3 id="org2d75d02"><span class="section-number-3">1.3</span> Length</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Also like strings, arrays have the <b>length</b> property.
</p>

<div class="org-src-container">
<pre class="src src-js">const empty = [];
console.log(empty.length); // 0

const little = [0];
console.log(little.length); // 1

const evenNumbers = [2, 4, 6, 8, 10];
console.log(evenNumbers.length); // 5

const fruits = ['apple', 'banana', 'cherry'];
console.log(fruits.length); // 3
console.log(fruits[fruits.length - 1]); // cherry

const matrix = [
  [1, 2, 3],
  [4, 5, 6],
  [7, 8, 9]
];
console.log(matrix.length); // 3
console.log(matrix[matrix.length - 1]); // [7, 8, 9]
console.log(matrix[0].length); // 3 -- because the first row of the matrix is an array of 3 values
</pre>
</div>
</div>
</div>

<div id="outline-container-orge06c2c2" class="outline-3">
<h3 id="orge06c2c2"><span class="section-number-3">1.4</span> Gotcha! Equality</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Checking if two arrays are equal (i.e. the same values) is counter-intuitive in JavaScript. Let's look at an example.
</p>

<div class="org-src-container">
<pre class="src src-js">const numbers = [1, 2, 3];
const sameNumbers = [1, 2, 3];
console.log(numbers === numbers); // true
console.log(numbers === sameNumbers); // false!
</pre>
</div>

<p>
What? How could this be false? The two arrays are clearly identical. It turns out that JavaScript's equality operator (<code>===</code>) is not actually checking equality when it comes to arrays. It's checking whether they are the same exact variable. The bottom line is, don't try to compare arrays with the equality operator (<code>===</code>). (If you need to check if two arrays are equal, use a library like <a href="https://underscorejs.org/#isEqual">Underscore.js</a> or <a href="https://ramdajs.com/docs/#equals">Ramda</a>.)
</p>
</div>
</div>

<div id="outline-container-orgc87269f" class="outline-3">
<h3 id="orgc87269f"><span class="section-number-3">1.5</span> Methods</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Let's look at some array methods we can get a lot of use out of.
</p>
</div>

<div id="outline-container-org20414e3" class="outline-4">
<h4 id="org20414e3"><span class="section-number-4">1.5.1</span> includes()</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
The <code>includes()</code> method lets us check if a specific value is included in an array, returning true or false.
</p>

<div class="org-src-container">
<pre class="src src-js">const empty = [];
console.log(empty.includes(0)); // false

const little = [0];
console.log(little.includes(0)); // true
console.log(little.includes('anything')); // false

const evenNumbers = [2, 4, 6, 8, 10];
console.log(evenNumbers.includes(4)); // true
console.log(evenNumbers.includes(3)); // false

const fruits = ['apple', 'banana', 'cherry'];
console.log(fruits.includes('banana')); // true
console.log(fruits.includes('app')); // false
console.log(fruits.includes('Apple')); // false
console.log(fruits[0].includes('app')); // true -- using string includes()
console.log(fruits.includes('donut')); // false

const matrix = [
  [1, 2, 3],
  [4, 5, 6],
  [7, 8, 9]
];
console.log(matrix.includes([1, 2, 3])); // false -- because of equality!
console.log(matrix[2].includes(9)); // true
</pre>
</div>
</div>
</div>

<div id="outline-container-orga0e0070" class="outline-4">
<h4 id="orga0e0070"><span class="section-number-4">1.5.2</span> slice()</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
The <code>slice()</code> method lets us grab just a portion of an array. The first argument is the index to start from. The optional second argument is the index to stop at (without the second argument, it goes until the end). It returns an array containing the elements between. It will always return an array, even if it's empty.
</p>

<div class="org-src-container">
<pre class="src src-js">const empty = [];
console.log(empty.slice(0)); // []

const little = [0];
console.log(little.slice(1)); // []

const evenNumbers = [2, 4, 6, 8, 10];
console.log(evenNumbers.slice(1)); // [4, 6, 8, 10]
console.log(evenNumbers.slice(2, 3)); // [6]

const fruits = ['apple', 'banana', 'cherry'];
console.log(fruits.slice(2)); // ['cherry']

const matrix = [
  [1, 2, 3],
  [4, 5, 6],
  [7, 8, 9]
];
console.log(matrix.slice(1, 2)); // [[4, 5, 6]]
console.log(matrix.slice(1, 2)[0].slice(0, 1)); // [4]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae5d95d" class="outline-4">
<h4 id="orgae5d95d"><span class="section-number-4">1.5.3</span> sort()</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
It's often that we have a list of numbers, words, or other things that need to be sorted into order. The <code>sort()</code> method lets us do exactly that!
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [3, 99, 0, -6, 10];
console.log(someNumbers.sort()); // [ -6, 0, 10, 3, 99 ]

const fruits = ['banana', 'cherry', 'fig', 'apple', 'date', 'elderberry'];
console.log(fruits.sort()); // [ 'apple', 'banana', 'cherry', 'date', 'elderberry', 'fig' ]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee6c197" class="outline-4">
<h4 id="orgee6c197"><span class="section-number-4">1.5.4</span> reverse()</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
We can use <code>reverse()</code> to reverse the order of an array.
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [3, 99, 0, -6, 10];
console.log(someNumbers.reverse()); // [ 10, -6, 0, 99, 3 ]
console.log(someNumbers.sort().reverse()); // [ 99, 3, 10, 0, -6 ]

const fruits = ['banana', 'cherry', 'fig', 'apple', 'date', 'elderberry'];
console.log(fruits.sort().reverse()); // [ 'fig', 'elderberry', 'date', 'cherry', 'banana', 'apple' ]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org50ec29d" class="outline-3">
<h3 id="org50ec29d"><span class="section-number-3">1.6</span> Gotcha! Sneaky Methods</h3>
<div class="outline-text-3" id="text-1-6">
<p>
The <code>sort()</code> and <code>reverse()</code> methods do something sneaky that you probably didn't realize. They <i>change the original array</i>. That means, after using <code>sort()</code> or <code>reverse()</code> on an array, you no longer have the original order! You can't stop them from doing this, but being aware of it can help you track down tricky bugs caused by it.
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [3, 99, 0, -6, 10];
console.log(someNumbers); // [ 3, 99, 0, -6, 10 ]
console.log(someNumbers.reverse()); // [ 10, -6, 0, 99, 3 ]
console.log(someNumbers); // [ 10, -6, 0, 99, 3 ] -- not the original order!
console.log(someNumbers.sort()); // [ -6, 0, 10, 3, 99 ]
console.log(someNumbers); // [ -6, 0, 10, 3, 99 ] -- updated again!
</pre>
</div>

<p>
We can know that <code>sort()</code> behaves this way because the <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/sort">MDN documentation</a> says it sorts the array <i>in place</i>.
</p>
</div>
</div>

<div id="outline-container-org0a18df4" class="outline-3">
<h3 id="org0a18df4"><span class="section-number-3">1.7</span> Adding to Arrays</h3>
<div class="outline-text-3" id="text-1-7">
<p>
We have seen how we can extract a single element from an array using its index. And we can take a portion of an array using <code>slice()</code>, ending up with fewer elements. But what if we want to add more elements to an array?
</p>

<p>
If we try to do something like the following, we won't end up with the array we want.
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [1, 2, 3];
const moreNumbers = [someNumbers, 4, 5, 6];
console.log(moreNumbers); // [ [ 1, 2, 3 ], 4, 5, 6 ]
</pre>
</div>

<p>
The array <code>someNumbers</code> is treated as a single value, put inside a new array, followed by the next few numbers.
</p>

<p>
We need to use some new syntax. The <b>spread</b> operator: <code>...</code> . We can spread out an array's elements as separate values.
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [1, 2, 3];
const moreNumbers = [...someNumbers, 4, 5, 6];
console.log(moreNumbers); // [ 1, 2, 3, 4, 5, 6 ]
</pre>
</div>

<p>
The spread operator can be used on any array. Adding arrays together becomes very easy.
</p>

<div class="org-src-container">
<pre class="src src-js">console.log([...[1, 2, 3], ...[4, 5, 6], ...['apple', 'banana', 'cherry']]); // [ 1, 2, 3, 4, 5, 6, 'apple', 'banana', 'cherry' ]

// Watch what happens without spread
console.log([ [1, 2, 3], [4, 5, 6], ['apple', 'banana', 'cherry'] ]); // [ [1, 2, 3], [4, 5, 6], ['apple', 'banana', 'cherry'] ]
</pre>
</div>

<p>
Adding a new element to an array is easy now. We can even add it to the start or the end.
</p>

<div class="org-src-container">
<pre class="src src-js">const fruits = ['banana', 'cherry'];

const moreFruits = ['apple', ...fruits];
console.log(moreFruits); // [ 'apple', 'banana', 'cherry' ]

const evenMoreFruits = [...moreFruits, 'date'];
console.log(evenMoreFruits); // [ 'apple', 'banana', 'cherry', 'date' ]
</pre>
</div>

<p>
With a bit of cleverness, we can even add an element somewhere in the middle!
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [1, 2, 3, 5, 6, 7];
const moreNumbers = [...someNumbers.slice(0, 3), 4, ...someNumbers.slice(3)];
console.log(moreNumbers); // [ 1, 2, 3, 4, 5, 6, 7 ]
</pre>
</div>

<p>
Or replace the first element.
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [99, 2, 3, 4];
const betterNumbers = [1, ...someNumbers.slice(1)];
console.log(betterNumbers); // [ 1, 2, 3, 4 ]
</pre>
</div>

<p>
In fact, the spread operator can be used to copy arrays so the <code>sort()</code> and <code>reverse()</code> gotcha doesn't affect us!
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [3, 99, 0, -6, 10];
const fakeCopyNumbers = someNumbers; // not a real copy
const copyNumbers = [...someNumbers]; // exact copy of someNumbers

console.log(someNumbers); // [3, 99, 0, -6, 10] -- original order
console.log(someNumbers.sort()); // [ -6, 0, 10, 3, 99 ] -- sorted

console.log(someNumbers); // [ -6, 0, 10, 3, 99 ] -- not the original order!
console.log(fakeCopyNumbers); // [ -6, 0, 10, 3, 99 ] -- not the original order because it's a fake copy!
console.log(copyNumbers); // [3, 99, 0, -6, 10] -- still has the original order because it's a copy
</pre>
</div>

<p>
The most common real-world uses of adding to arrays are: adding an element to the end of an array, and adding two arrays together.
</p>

<div class="org-src-container">
<pre class="src src-js">const teachers = ['Alice', 'Bob', 'Carol'];
const newTeachers = [...teachers, 'Dave']; // add the new teacher Dave
console.log(newTeachers); // [ 'Alice', 'Bob', 'Carol', 'Dave' ]

const managers = ['Eve', 'Frank', 'Grace'];
const staff = [...newTeachers, ...managers]; // gather all staff together
console.log(staff);// [ 'Alice', 'Bob', 'Carol', 'Dave', 'Eve', 'Frank', 'Grace' ]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb740a94" class="outline-2">
<h2 id="orgb740a94"><span class="section-number-2">2</span> Exercises</h2>
<div class="outline-text-2" id="text-2">
<ul>
	<li><a href="07-arrays-exercises.js">View exercises</a></li>
	<li><a href="07-arrays-exercises.js" download type="application/octet-stream">Download exercises</a></li>
	<li><a href="07-arrays-solutions.js">View solutions</a></li>
	<li><a href="07-arrays-solutions.js" download type="application/octet-stream">Download solutions</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
